# Pandas Exercise
This exercise deals with the Pandas library.

**Remark**: Add a new cell above the desired output. Otherwise you would overwrite the expected result!

In [3]:
# Import packages
import pandas as pd
import numpy as np

## 1. Pandas Series and DataFrames Basics

### **Pandas Series**

Create a **numpy array** from integers 1 to 5 called **data** and another one containing the characters A to E **called indices**.

In [4]:
# solution
data = np.arange(1,6)
indices = np.array(['A','B','C','D','E'])

Use the Pandas method **pd.Series(data,indices)** to create a Pandas Series called **series**.

In [5]:
# solution
series = pd.Series(data,indices)
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

Access the third element of the series by using the **named index** and by using the **location index**.

In [24]:
# solution
series['C']
series.iloc[2]

3

**Square** each element of the series.

In [7]:
# solution
series.apply(lambda x: x**2)
series**2

A     1
B     4
C     9
D    16
E    25
dtype: int64

Create another series called **seriesFromDict** using a **python dictionary**. The **keys** of the dictionary should  be characters from **C to F** and all **values are 0.5**. Then use again **pd.Series(myDict)**.

In [8]:
# solution
myDict = {'C': 0.5, 'D': 0.5, 'E': 0.5, 'F':0.5}
seriesFromDict = pd.Series(myDict)
seriesFromDict

C    0.5
D    0.5
E    0.5
F    0.5
dtype: float64

**Sum** both Pandas Series **series** and **seriesFromDict**.

In [9]:
series + seriesFromDict

A    NaN
B    NaN
C    3.5
D    4.5
E    5.5
F    NaN
dtype: float64

### **Pandas DataFrames**

A Pandas DataFrame is a collection of Pandas Series. Each column and each row represents a Pandas Series. A DataFrame has named indices and named columns.

Use the following three numpy arrays to **construct a DataFrame using the function pd.DataFrame()**. Name the columns **'age'**, **'country'** and **'salary'**.  
Please use the *dictionary-method* to construct the DataFrame and call it df. Afterwards, show the first 10 records (rows) of the DataFrame using the **head(n)**-method.

In [10]:
# random seed
np.random.seed(0)

# three numpy arrays
country = np.random.choice(['USA', 'GER'], size=30)
age = np.random.randint(18,75,size=30)
salary = age * 4000 + 2000 * np.random.randn()

In [25]:
# solution
df = pd.DataFrame({'country': country, 'age': age, 'salary': salary})
df.head(10)

   age country         salary
0   27     USA  112539.509248
1   38     GER  156539.509248
2   69     GER  280539.509248
3   34     USA  140539.509248
4   69     GER  280539.509248
5   23     GER   96539.509248
6   33     GER  136539.509248
7   65     GER  264539.509248
8   18     GER   76539.509248
9   36     GER  148539.509248

What are the **data types** of the columns and how much **memory** does the DataFrame use?

In [10]:
# solution
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
age        30 non-null int64
country    30 non-null object
salary     30 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 800.0+ bytes

Compute the **mean, median, min and max** values of the column **age** and **salary**.

**Hint:** There is one easy method to get all results at the same time.

In [11]:
# solution
df.describe()
#df.mean()
#df.median()
#df.max()
#df.min()

             age         salary
count  30.000000      30.000000
mean   44.566667  182806.175915
std    16.506390   66025.561055
min    18.000000   76539.509248
25%    32.250000  133539.509248
50%    41.500000  170539.509248
75%    56.000000  228539.509248
max    70.000000  284539.509248

#### Conditional Indexing:

Please answer the following questions using conditional indexing. Keep in mind to use paranthesis for each condition and combine condtions with the & or | symbol.

1. How many people are older than 20?
2. How many people from Germany are older than 20?
3. How many people earn more than 200 000 or are older than 30?

In [12]:
#count()

In [13]:
# solution
#df[(df['age'] > 20)]
#df[(df['country'] == 'GER') & (df['age'] > 20)].describe()
len(df[(df['age'] > 30) | (df['salary'] > 200000)])

23


#### Basic Aggregations and Operations on DataFrames

Compute the **mean and standard deviation** of the age column **grouped by the country**.

In [31]:
country = 'country'

In [34]:
df_agg = df.groupby('country').agg({'age': [np.mean, np.std]})
df_agg

               age
              mean        std
country
GER      46.647059  17.620802
USA      41.846154  15.175892

In [30]:
# solution
df_agg = df[df['country'] == 'GER'].groupby('country')\
    .agg({'age': [np.mean, 'median']})
df_agg

               age
              mean median
country
GER      46.647059     50

**Access the the mean of the age column** for the country GER.

**Hint:** For multi-indices/multi-columns use a **tuple** e.g. df[('outer-col', 'inner-col')].

In [35]:
# solution
#df_agg[(:,'mean')]['GER']

df_agg.loc['GER', ('age','mean')]

46.64705882352941

**Apply a function to the dataframe df** which transforms the uppercase country names of the column country to lowercase ones.
Add a new column named **country_lowercase** which holds the lowercase country names.

**Hint:** Use the apply method and inside of the method a lambda function which does sth. like 'HELLO'.lower() --> 'hello'.

In [36]:
def getLower(x):
    return x.lower()

In [37]:
getLower('Marcel')

'marcel'

In [39]:
df.head()

   age country         salary
0   27     USA  112539.509248
1   38     GER  156539.509248
2   69     GER  280539.509248
3   34     USA  140539.509248
4   69     GER  280539.509248

In [40]:
df['country_lowercase'] = df['country'].apply(lambda x: x.lower())
df.head()

   age country         salary country_lowercase
0   27     USA  112539.509248               usa
1   38     GER  156539.509248               ger
2   69     GER  280539.509248               ger
3   34     USA  140539.509248               usa
4   69     GER  280539.509248               ger

In [21]:
# solution
df['country_lowercase'] = df['country'].apply(lambda x: x.lower())
df.head()

   age country         salary country_lowercase
0   27     USA  112539.509248               usa
1   38     GER  156539.509248               ger
2   69     GER  280539.509248               ger
3   34     USA  140539.509248               usa
4   69     GER  280539.509248               ger

Add a new column which holds the salary per year of life for each entry. Name the column **salary_per_yol**.

In [25]:
%%timeit
df['salary_per_yol'] = df['salary'] / df['age']

175 µs ± 2.16 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

#### Join DataFrames

The two cells below create two DataFrames. Please execute the two cells and go on.

In [43]:
# just execute
df_animals = pd.DataFrame({'Animal': ['Cat', 'Dog', 'Bird',
                                      'Lion', 'Cow', 'Pig'],
                           'Sound': ['miau', 'wuff', 'chirp',
                                     'rawr', 'moo', 'oink']})
df_animals

  Animal  Sound
0    Cat   miau
1    Dog   wuff
2   Bird  chirp
3   Lion   rawr
4    Cow    moo
5    Pig   oink

In [44]:
# just execute
df_names = pd.DataFrame({'Animal': ['Cat', 'Cat', 'Bird', 'Dog', 'Pig'],
                         'Name': ['Sylvester', 'Carlo', 'Tweety', 'Balto', 'Babe']})
df_names

  Animal       Name
0    Cat  Sylvester
1    Cat      Carlo
2   Bird     Tweety
3    Dog      Balto
4    Pig       Babe

**Merge** the two dataframes by using the column **Animal as the key**. To join DataFrames you can use the method **pd.merge(df1,df2,on=column)**. Please perform an **inner** and an **outer** join.

In [28]:
# inner join
df_inner = <FILL-IN>
df_inner

In [45]:
# solution
df_inner = pd.merge(df_animals, df_names, on='Animal')
df_inner

  Animal  Sound       Name
0    Cat   miau  Sylvester
1    Cat   miau      Carlo
2    Dog   wuff      Balto
3   Bird  chirp     Tweety
4    Pig   oink       Babe

In [30]:
# outer join
df_outer = pd.merge(<FILL-IN>, how='outer', on=<FILL-IN>)
df_outer

In [46]:
# solution
df_outer = pd.merge(df_animals, df_names, how='outer', on='Animal')
df_outer

  Animal  Sound       Name
0    Cat   miau  Sylvester
1    Cat   miau      Carlo
2    Dog   wuff      Balto
3   Bird  chirp     Tweety
4   Lion   rawr        NaN
5    Cow    moo        NaN
6    Pig   oink       Babe

**Drop the rows which contain NaN** by using the method **dropna()** on the merged dataframe df_outer.

In [50]:
df_outer.drop(columns=['Sound'])

  Animal       Name
0    Cat  Sylvester
1    Cat      Carlo
2    Dog      Balto
3   Bird     Tweety
4   Lion        NaN
5    Cow        NaN
6    Pig       Babe

In [35]:
# drop row
df_outer.<FILL-IN>

In [51]:
# solution
df_outer.dropna()

  Animal  Sound       Name
0    Cat   miau  Sylvester
1    Cat   miau      Carlo
2    Dog   wuff      Balto
3   Bird  chirp     Tweety
6    Pig   oink       Babe

**Drop the column** of df_outer which contains NaN using **dropna()**.

In [37]:
# drop column
df_outer.<FILL-IN>

In [52]:
# solution
df_outer.dropna(axis=1)

  Animal  Sound
0    Cat   miau
1    Cat   miau
2    Dog   wuff
3   Bird  chirp
4   Lion   rawr
5    Cow    moo
6    Pig   oink